In [9]:
import pandas as pd
group4= r"C:\Users\Christabel\Desktop\Book1.xlsx"
c=pd.read_excel(group4)
c

                      Name  Group
0         Ajewole Emmanuel       4
1            Taiwo Adedayo       4
2  Chukwunweike Christabel       4
3           Adewolo Mariam       4

In [10]:
 c["sex"]=["M","M","F","F"]
 c

                      Name  Group  sex
0         Ajewole Emmanuel       4   M
1            Taiwo Adedayo       4   M
2  Chukwunweike Christabel       4   F
3           Adewolo Mariam       4   F

In [ ]:
c